Revit 2027 API
FormulaManager Methods
The FormulaManager type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
Evaluate |  Evaluates value of the formula
GetFunctions |  Gets list of function names supported by formula engine
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetOperators |  Gets list of operator names supported by formula engine
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Validate |  Validates the formuls
Top
See Also
Reference
FormulaManager Class
Autodesk.Revit.DB Namespace